## Pandas 

    -used to perform data Manipulation, building Machine learning models and lot more.

    - there are two data structures in pandas
        - Data Series 
        - Data Frames

In [89]:
import pandas as pd

In [90]:
pd.__version__

'1.0.1'

### Pandas Series:
- A series is similar to a 1-D numpy array, and contains values of the same type (numeric, character, datetime  etc.). A dataframe is simply a table where each column is a pandas series.

In [97]:
# Create a Data Series using List
li = [12,4,54,57,76,8,9,34]

In [106]:
s = pd.Series(li,index=list('abcdefgh'))
s

a    12
b     4
c    54
d    57
e    76
f     8
g     9
h    34
dtype: int64

In [113]:
print(s[0])
print(s['a'])
print(s[6])
print(s['g'])

12
12
9
9

In [107]:
# create series using tuple
t = (12,34,54,6,21,45,233,12,32,34)
st = pd.Series(t,index=range(1,11))

In [108]:
st

1      12
2      34
3      54
4       6
5      21
6      45
7     233
8      12
9      32
10     34
dtype: int64

In [101]:
# create series using dict
d = {"name":'vansh','age':25,'subj':'maths'}
sd = pd.Series(d)

In [102]:
sd

name    vansh
age        25
subj    maths
dtype: object

In [10]:
st.index = list('abcdefghi')
st

a      12
b      34
c      54
d       6
e      21
f      45
g     233
h      12
i    3234
dtype: int64

In [20]:
st['g']
st[5]

45

In [21]:
s[0]

12

In [13]:
s

0    12
1     4
2    54
3    57
4    76
5     8
6     9
7    34
dtype: int64

In [14]:
s[1:6]

1     4
2    54
3    57
4    76
5     8
dtype: int64

In [15]:
s[1:7:2] # start, end(Exclusive) , step

1     4
3    57
5     8
dtype: int64

In [16]:
# create data Series by using numpy array
import numpy as np

In [29]:
snp = pd.Series(np.array(np.random.randint(1,50,10)))

In [30]:
snp

0    26
1    40
2    46
3    15
4    33
5    44
6    12
7    45
8    38
9     7
dtype: int32

In [40]:
snp.index = np.arange(51,61)

In [41]:
snp

51    26
52    40
53    46
54    15
55    33
56    44
57    12
58    45
59    38
60     7
dtype: int32

In [42]:
s4 = pd.Series(list('abcdef'), index= [1,2,3,4,5,6])

In [43]:
s4

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [119]:
s = pd.Series([x**2 for x in range(1,11)],index=list('abcdefhijk'))

In [120]:
s

a      1
b      4
c      9
d     16
e     25
f     36
h     49
i     64
j     81
k    100
dtype: int64

In [51]:
ss = pd.Series(np.square(np.arange(1,11)))

In [52]:
ss

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int32

## Pandas Dataframes

In [127]:
# creating DataFrame using List
df1 = pd.DataFrame([[1,2,3,4,4,4],[12,34,45,65,67,32]])
df1

    0   1   2   3   4   5
0   1   2   3   4   4   4
1  12  34  45  65  67  32

In [62]:
# using Tuples 
df2 = pd.DataFrame(((1,2,3,4,4,4),(12,34,45,65,67,32)))
df2

    0   1   2   3   4   5
0   1   2   3   4   4   4
1  12  34  45  65  67  32

In [74]:
di1 = {"Name" : ["Prasad","sravani","latha","lavanya"],
       "Pin":[333,444,777,656],
       "Branch":["Mech","CSE","IT","ECE"]  
}

In [75]:
df4 = pd.DataFrame(di1)

In [76]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

In [77]:
df4.shape

(4, 3)

In [78]:
df4.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
df4["Name"]  # accessing sub df - series

0     Prasad
1    sravani
2      latha
3    lavanya
Name: Name, dtype: object

In [80]:
df4["Branch"] # 1-D data

0    Mech
1     CSE
2      IT
3     ECE
Name: Branch, dtype: object

In [82]:
df4[["Name","Branch"]] # 2-D sub df

      Name Branch
0   Prasad   Mech
1  sravani    CSE
2    latha     IT
3  lavanya    ECE

In [83]:
# get sravani's Pin number
df4["Name"]

0     Prasad
1    sravani
2      latha
3    lavanya
Name: Name, dtype: object

In [85]:
df4["Pin"][1]

444

In [87]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

# Indexing and Slicing

In [90]:
df4[:1]

     Name  Pin Branch
0  Prasad  333   Mech

In [93]:
df4[2:3]

    Name  Pin Branch
2  latha  777     IT

In [94]:
df4[0]

KeyError: 0

In [96]:
df4[::2]

     Name  Pin Branch
0  Prasad  333   Mech
2   latha  777     IT

In [98]:
len(li)

11

In [105]:
df5 = pd.DataFrame(li, index = list("abcdefghije"))
df5

     0
a  100
b  121
c  144
d  169
e  196
f  225
g  256
h  289
i  324
j  361
e  400

In [106]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

In [107]:
df4["Branch"] # as series

0    Mech
1     CSE
2      IT
3     ECE
Name: Branch, dtype: object

In [108]:
df4[["Branch"]]

  Branch
0   Mech
1    CSE
2     IT
3    ECE

In [109]:
df4["%"] = [90,98,89,78]
df4

      Name  Pin Branch   %
0   Prasad  333   Mech  90
1  sravani  444    CSE  98
2    latha  777     IT  89
3  lavanya  656    ECE  78

In [112]:
df4.set_index("Name")

         Pin Branch   %
Name
Prasad   333   Mech  90
sravani  444    CSE  98
latha    777     IT  89
lavanya  656    ECE  78

In [113]:
df4

      Name  Pin Branch   %
0   Prasad  333   Mech  90
1  sravani  444    CSE  98
2    latha  777     IT  89
3  lavanya  656    ECE  78

In [114]:
df4.set_index("Name", inplace = True)

In [115]:
df4

         Pin Branch   %
Name
Prasad   333   Mech  90
sravani  444    CSE  98
latha    777     IT  89
lavanya  656    ECE  78

In [120]:
df4.reset_index(inplace=True)

In [128]:
df4[2:3][["Name","Branch"]]

    Name Branch
2  latha     IT

## iloc -- for accessing rows using integer indicies
## loc -- for accessing rows other than integer indicies

In [129]:
df4.iloc[2]

Name      latha
Pin         777
Branch       IT
%            89
Name: 2, dtype: object

In [131]:
df4.iloc[0]

Name      Prasad
Pin          333
Branch      Mech
%             90
Name: 0, dtype: object

In [132]:
df4.iloc[1:5:2]

      Name  Pin Branch   %
1  sravani  444    CSE  98
3  lavanya  656    ECE  78

In [137]:
df4.loc[3,["Pin","Name"]]

Pin         656
Name    lavanya
Name: 3, dtype: object

In [138]:
df4.loc[[2,1],["Name","%"]]

      Name   %
2    latha  89
1  sravani  98

In [146]:
df4.iloc[3,"Pin"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [144]:
df4.loc[3]

Name      lavanya
Pin           656
Branch        ECE
%              78
Name: 3, dtype: object

In [145]:
df4.loc[2,"Pin"]

777

# File reading

In [67]:
import pandas as pd
data = pd.read_csv("Students.csv")
data

,S.No.,Registration Id,Name,Email,Mobile No
0,1,17001A0538,Devireddy Harivarun,harivarundevireddy@gmail.com,9493692436
1,2,18001A0503,Boya Sudha Rani,sudha.boya22@gmail.com,8008462366
2,3,18001A0505,T Bharath Kumar Reddy,bharath143775@gmail.com,8106925040
3,4,18001A0507,Manchala Vasundhara,manchalavasundhara@gmail.com,8919345514
4,5,18001A0509,Gummaraju Sai Hemanth Kumar,saihemath2000@gmail.com,9963097716
5,6,18001A0511,Petala Jagan,jaganpettla@gmail.com,8008051305
6,7,18001A0513,Sugali Uday Kiran,sugaliudaykirang@gmail.com,8008139871
7,8,18001A0519,Yallamgari Sujana,sujanayallangari@gmail.com,7674880318
8,9,18001A0523,Mohammed Farheen,farheenmhmd05@gmail.com,9381252264
9,10,18001A0528,Penakacherla Raviteja Yadav,raviyadav459p@gmail.com,8886887857
10,11,18001A0533,Sanna Balappa Gari Bhargav,sb.bhargav1993@gmail.com,9701312245
11,12,18001A0534,Shaik Jilani,jilan9652@gmail.com,9347690784
12,13,18001A0535,Kannali Sevitha Priya,sevithapriya136@gmail.com,9908087975
13,14,18001A0539,Bojjireddy Vineeth Reddy,brvineeth12@gmail.com,9959431389
14,15,18001A0542,P Reddy Tejaswi,tejaswi.parapatla@gmail.com,7032303135
15,16,18001A0543,Rajitha.G,grajitha100@gmail.com,7093941394
16,17,18001A0544,Nagaraju Gandu,Nagarajugandu76@gmail.com,9492902808
17,18,18001A0545,Meda Guru Santhosh Kumar,gurusanthoshkumarmeda@gmail.com,9052313200
18,19,18001A0547,Mohammad Salman Sunakal,shaiksalmanssn@gmail.com,9490881902
19,20,18001A0548,Mouryagottipati,gottipati.mourya@gmail.com,9381194449
20,21,18001A0561,Oramisi Daniel Odeke,danielodeke@outlook.com,7989799674
21,22,18001A0571,Mp Anusha Jayasree,mp.anujayasree@gmail.com,9494431705
22,23,18001A0574,Mandle Nandakishore Reddy,mandlenandakishore89@gmail.com,8106386899
23,24,18001A0578,Y. Bhavya,bhavyareddy997@gmail.com,7660957477
24,25,18001A0579,M. Alphonsa Mary Alexander,alphonsamaryalexander2001@gmail.com,9959528579
25,26,18001A538,K Jaya Krishna Reddy,jayakrishna2000.aa@gmail.com,9390366800
26,27,18005A0208,Nossam Shaik Ahamad Basha,ahammedbasha950@gmail.com,9505759750
27,28,19005A0215,B K Omkar Gowri,omkarbk963@gmail.com,9849640530
28,29,19005A0507,Chandragiri Jyoshna,chandragiri.jyoshna@gmail.com,7702851194
29,30,19005A0514,Sai Nikhila Indhirala,sainikhilaindhirala424@gmail.com,9398507959
30,31,19005A0516,Yanamala Aswini,yanamala.aswini99@gmail.com,9491280292
31,32,19005A0518,Eswar Mekala,mekalaeswar123456@gmail.com,9000021883
32,33,19005A0520,Uyyalawada Sandhya Rani,uyyalawadasandhyarani@gmail.com,7386003127

In [69]:
data.set_index("Registration Id", inplace = True)

In [70]:
data.loc["18001A0574"]

S.No.                                    23
Name              Mandle Nandakishore Reddy
Email        mandlenandakishore89@gmail.com
Mobile No                        8106386899
Name: 18001A0574, dtype: object

In [72]:
data.head() # default first 5 records

,S.No.,Name,Email,Mobile No
Registration Id,,,,
17001A0538,1,Devireddy Harivarun,harivarundevireddy@gmail.com,9493692436
18001A0503,2,Boya Sudha Rani,sudha.boya22@gmail.com,8008462366
18001A0505,3,T Bharath Kumar Reddy,bharath143775@gmail.com,8106925040
18001A0507,4,Manchala Vasundhara,manchalavasundhara@gmail.com,8919345514
18001A0509,5,Gummaraju Sai Hemanth Kumar,saihemath2000@gmail.com,9963097716

In [73]:
data.tail()

,S.No.,Name,Email,Mobile No
Registration Id,,,,
19005A0507,29,Chandragiri Jyoshna,chandragiri.jyoshna@gmail.com,7702851194
19005A0514,30,Sai Nikhila Indhirala,sainikhilaindhirala424@gmail.com,9398507959
19005A0516,31,Yanamala Aswini,yanamala.aswini99@gmail.com,9491280292
19005A0518,32,Eswar Mekala,mekalaeswar123456@gmail.com,9000021883
19005A0520,33,Uyyalawada Sandhya Rani,uyyalawadasandhyarani@gmail.com,7386003127

In [79]:
data.sample(4) # random selection

,S.No.,Name,Email,Mobile No
Registration Id,,,,
18001A0511,6,Petala Jagan,jaganpettla@gmail.com,8008051305
18001A538,26,K Jaya Krishna Reddy,jayakrishna2000.aa@gmail.com,9390366800
19005A0516,31,Yanamala Aswini,yanamala.aswini99@gmail.com,9491280292
18001A0544,17,Nagaraju Gandu,Nagarajugandu76@gmail.com,9492902808

In [80]:
data.columns

Index(['S.No.', 'Name', 'Email', 'Mobile No'], dtype='object')

In [81]:
data.index

Index(['17001A0538', '18001A0503', '18001A0505', '18001A0507', '18001A0509',
       '18001A0511', '18001A0513', '18001A0519', '18001A0523', '18001A0528',
       '18001A0533', '18001A0534', '18001A0535', '18001A0539', '18001A0542',
       '18001A0543', '18001A0544', '18001A0545', '18001A0547', '18001A0548',
       '18001A0561', '18001A0571', '18001A0574', '18001A0578', '18001A0579',
       '18001A538', '18005A0208', '19005A0215', '19005A0507', '19005A0514',
       '19005A0516', '19005A0518', '19005A0520'],
      dtype='object', name='Registration Id')

### Date range Method

In [59]:
dates = pd.date_range(start= '2021-10-5',end='2021-10-12')

In [60]:
dates

DatetimeIndex(['2021-10-05', '2021-10-06', '2021-10-07', '2021-10-08',
               '2021-10-09', '2021-10-10', '2021-10-11', '2021-10-12'],
              dtype='datetime64[ns]', freq='D')

In [53]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [58]:
date = pd.date_range(start='2018-04-24', end='2018-04-27')
date

DatetimeIndex(['2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27'], dtype='datetime64[ns]', freq='D')